# [chap01]240516_Group2_Review

📘 김채은 :

왜 NoSQL을 쓰셨나요?/왜 mongoDB를 쓰셨나요? 라는 질문이 나온다면?

→ ‘그냥 mysql쓰는거보단 쉬워보여서/러닝커브가 낮아서…’ 라고 대답하기보단 ‘규모 확장이 편해서/데이터가 비정형이라서/아주 많은 양의 데이터를 저장할 필요가 있어서…’ 등등이라고 대답하자.

📘 김수진 :

데이터를 직렬화하거나(serialize) 역직렬화(deserialize) 할 수 있기만 하면 되는 경우 일 때 비-관계형 데이터베이스를 쓴다는 게 무슨 뜻일까?

→ 김채은 : 데이터를 굳이 구조화하지 않아도 데이터 객체를 처리할 수 있는 경우라는 뜻. (Reference: [https://shuu.tistory.com/193](https://shuu.tistory.com/193)을 참고하자!)

📘 정성호 :

cdn → 정적 콘텐츠 한정이라면 동적컨텐츠는 캐시가 불가능한가?

📘 신주은 :

서버의 자원들이 오류가 날걸 대비해서 분산시키자. 그걸 다 관리하기 위해 로드밸런서를 쓰자.

→ 그런데 로드밸런서가 망가진다면 어떻게 될까?

📘 정현석 :

아마존 rds는 두가지의 복제방식을 사용한다.

1. Multi - AZ : 주디비가 고장나면 보조디비를 승격시켜 주디비로 만든다.
2. Read Replica : 읽기만 가능한 여러 개의 보조디비를 만들어준다.
   1. 이걸 사용해서 샤딩을 적용하면 백엔드 구현할 때 좋다.
      1. 메모리 효율, 데이터 안전하게 보장 등등

📘 홍예림 :

기존에 알고있던 메트릭의 개념을 확장할 수 있었다. 다양한 종류의 메트릭을 모니터링을 해야한다는 것을 알게 되었다.
